In [1]:
import pandas as pd

In [2]:
df = pd.read_csv("AirPassengers.csv")

In [5]:
#show me first five records 
df.head()

     Month  #Passengers
0  1949-01          112
1  1949-02          118
2  1949-03          132
3  1949-04          129
4  1949-05          121

In [6]:
# show me last five records
df.tail()

       Month  #Passengers
139  1960-08          606
140  1960-09          508
141  1960-10          461
142  1960-11          390
143  1960-12          432

In [7]:
#dimention of the dataset
df.shape

(144, 2)